In [2]:
# Earliest, Latest, Total, and Number of Authors
import pandas as pd

In [3]:
file = "Resources/books_clean.csv"
good_read_summary = pd.read_csv(file)
good_read_summary.head()

,ISBN,Publication Year,Original Title,Authors,One Star Reviews,Two Star Reviews,Three Star Reviews,Four Star Reviews,Five Star Reviews
0,439023483,2008.0,The Hunger Games,Suzanne Collins,66715,127936,560092,1481305,2706317
1,439554934,1997.0,Harry Potter and the Philosopher's Stone,"J.K. Rowling, Mary GrandPré",75504,101676,455024,1156318,3011543
2,316015849,2005.0,Twilight,Stephenie Meyer,456191,436802,793319,875073,1355439
3,61120081,1960.0,To Kill a Mockingbird,Harper Lee,60427,117415,446835,1001952,1714267
4,743273567,1925.0,The Great Gatsby,F. Scott Fitzgerald,86236,197621,606158,936012,947718

In [34]:
#Total number of Reviews
#Reviews = ["One Star Reviews", "Two Star Reviews", "Three Star Reviews", "Four Star Reviews", "Five Star Reviews"]
#total_reviews = good_read_summary[Reviews].sum()
total_reviews = good_read_summary["One Star Reviews"].sum()+good_read_summary["Two Star Reviews"].sum()+good_read_summary["Three Star Reviews"].sum()+good_read_summary["Four Star Reviews"].sum()+good_read_summary["Five Star Reviews"].sum()
total_reviews

596873216

In [16]:
#Unique Authors
unique_authors = good_read_summary["Authors"].nunique()
unique_authors

4664

In [40]:
# earliest published book
earliest_year = good_read_summary["Publication Year"].min()
earliest_year

-1750.0

In [39]:
latest_year = good_read_summary["Publication Year"].max()
latest_year

2017.0

In [45]:
#summary
summary_table = pd.DataFrame({"Total Unique Authors":unique_authors,
                             "Earliest Year": [earliest_year],
                             "Latest_Year": [latest_year],
                             "Author Count": [unique_authors]})
summary_table

   Author Count  Earliest Year  Latest_Year  Total Unique Authors
0          4664        -1750.0       2017.0                  4664